package com.ehsanmokhtari.brainchallenger;

import java.util.Random;

public class Quotes {
    Random randomMessage = new Random();

    String[] stringQuotes = {"نگران آینده نباش زیرا خداوند قبل از تو آنجاست ...", "همانا با یاد خدا قلب ها آرام میگیرد ... ",
            "تلاش شاید نتیجش موفقیت نباشه،اما هیچوقت نتیجش حسرت نیست !",
            "خدا از اون چیزی که قراره فردا باهاش روبرو بشی،بزرگتره...", "شکست یه فرصتیه واسه شروعی دوباره،ولی با نبوغی بیشتر!",
            "شکست یه نوع ادویه هست!که به پیروزی مزه میده !", "افراد موفق اون چیزی که لازم هست رو انجام میدن،چه ازش خوششون بیاد و چه نه!",
            "یادت باشه عادت های قدیمی در های تازه رو واست باز نمیکنه !", "رویاهاتو دنبال کن تا موفق شی ! نه آدم هارو ...",
            "قبل این که تسلیم بشی به این فکر کن که اگه تسلیم نمیشدی ساله دیگه کجا بودی !",
            "یه برنده همون بازندست که باز تلاش کرده !", "حسرت چیزهایی رو بخور که انجام ندادی ، نه اونهایی که انجام دادی!",
            "وقتی میخوای تسلیم شی به ادمایی فکر کن که با تسلیم شدنت خوشحال میشن! پس تسلیم نشو ...",
            "با مشکلاتت  روبرو شو،قبل اینکه مشکلاتت با خوشحالیت رودررو شن !", "وقتی یکی گفت نمیتونی،نشون بده که اشتباه میکنه !",
            "هیچ چیز تو این دنیا همیشگی نیست!حتی مصیبت های ما...", "تو میتونی ! ختمه جلسه !",
            "یه مثلِ ژاپنی میگه : هفت بار زمین بخور ولی هشت بار بلند شو !",
            "هیچوقت اجازه نده ترست آیندتو تعیین کنه ...", "امتحان کن حتی اگه از نتیجش اطمینان نداری !",
            "اگه آماده اشتباه کردن نباشید،هیچ وقت فکره نابی به ذهنتون نمیرسه !",
    "اگه تلاش کردیو شکست خوردی از خیلیا جلوتری ! چون خیلیا حتی تلاش نمیکنن !","زندگی هر آدم موفقی،سالهای ناموفق زیادی پشت سرش داره !",
            "خوششانسی با سخت کوشی به دست میاد !","هیچوقت با بد نشون دادنه دیگرون ، خودت خوب به نظر نمیرسی ...",
            "دو چیز معرف توعه : اولی صبرت وقتی هیچی نداری ! دومی معرفتت وقتی همه چیز داری !",
            "دردی که امروز داری ، تبدیل میشه به قدرتی که فردا خواهی داشت !"
    };

    String[] correctStrings = {"کارت درسته !","مغز نیس که کامپیوتره !","آفریننن","استیون هاوکینگه کی بودی تو !",
            "بابا انیشتین !","دمت آتیشی !"   ,"بابا نابغه ...","اسکار ریاضی مال تو !","بگو ماشالله !",
            "بابا جان اسنو !","بزنم ب تخته ...","ایول همینه !","دست استیو جابزو از پشت بستی !",
            "آن بزرگوار که میگن تویی !","هورررااااا","آهان درستش همینه !","شرلوک هولمز که میگن تویی ؟؟",
            "لوک خوش شانس!",
    };
    String[] wrongStrings = {"بیشتر تلاش کن","بیشتر زور بزن !",
            "حیف نون از تو باهوشتره", "به اون سلولای خاکستری مغزت فشار بیار","مغز نیس که فرغونه !",
            "تراکتور از تو سریعتره !","وایت واکر از تو باهوشتره !","ریاضیتو چند شدی؟","ترورت نکنن !","آب قطعه ...",
            "پت و مت از تو باهوشتره !","ژیان ...","سرت به جایی نخورده ؟!","عیب نداره بیشتر تلاش کن ","تلاش تلاش تلاش ...",
            "مغز نیس که تربچست !","هویج ...","شلغم از تو باهوشتره !","معدل اول ابتداییت چن بود ؟!","حتما لیسانس هم داری !",

    };

    public String getQuote(){
        return  stringQuotes[randomMessage.nextInt(stringQuotes.length)];}

    public String getCorrectAnswer(){
        return correctStrings[randomMessage.nextInt(correctStrings.length)];}

    public String getWrongAnswer(){
        return wrongStrings[randomMessage.nextInt(wrongStrings.length)];}

}
